OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USART/Driver_USART_UART.c
/*
 * Copyright (c) 2013-2020 Arm Limited. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#ifdef _RTE_
    #include "RTE_Components.h"
#endif
/* Project can define PRJ_RTE_DEVICE_HEADER macro to include private or global RTE_Device.h. */
#ifdef   PRJ_RTE_DEVICE_HEADER
    #include PRJ_RTE_DEVICE_HEADER
#else
    #include "RTE_Device/RTE_Device.h"
#endif

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "Driver_USART.h"
#include "NuMicro.h"

#include "drv_pdma.h"
#include "misc.h"

// Configuration depending on RTE_USART.h
// Check if at least one peripheral instance is configured in RTE_Device_USART.h
#if ((RTE_USART0 == 1) || \
    (RTE_USART1 == 1) || \
    (RTE_USART2 == 1) || \
    (RTE_USART3 == 1) || \
    (RTE_USART4 == 1) || \
    (RTE_USART5 == 1) || \
    (RTE_USART6 == 1) || \
    (RTE_USART7 == 1) || \
    (RTE_USART8 == 1) || \
    (RTE_USART9 == 1))

// Macros
#define ARM_USART_DRV_VERSION    ARM_DRIVER_VERSION_MAJOR_MINOR(1, 0)  /* driver version */
// Macro for porting compatibility
#define USART_HandleTypeDef  UART_T
// Macro for section for RW info
#ifdef  USART_SECTION_NAME
    #define USARTn_SECTION_(name,n) __attribute__((section(name #n)))
    #define USARTn_SECTION(n)       USARTn_SECTION_(USART_SECTION_NAME,n)
#else
    #define USARTn_SECTION(n)
#endif

// Macro to create usart_ro_info and usart_rw_info (for U(S)ART instances)
#define INFO_DEFINE(n)                                                      \
    static        RO_Info_t         usart##n##_ro_info = {  \
                                                            UART##n,                         \
                                                            UART##n##_IRQn,                  \
                                                            RTE_USART##n##_RX_PDMA,          \
                                                            RTE_USART##n##_TX_PDMA,          \
                                                            RTE_USART##n##_RX_PDMA_NUMBER,   \
                                                            RTE_USART##n##_TX_PDMA_NUMBER,   \
                                                            RTE_USART##n##_RX_PDMA_CHANNEL,  \
                                                            RTE_USART##n##_TX_PDMA_CHANNEL,  \
                                                            PDMA_UART##n##_RX,               \
                                                            PDMA_UART##n##_TX                \
                                                         }; \
    static        RW_Info_t         usart##n##_rw_info USARTn_SECTION(n) = { \
                                                                             .pdma_rx_chan_id = -1,  \
                                                                             .pdma_tx_chan_id = -1,  \
                                                                           };  \
    static  const USART_Info_t      usart##n##_info = { \
                                                        &usart##n##_ro_info,                                                \
                                                        &usart##n##_rw_info,                                                \
                                                      };

// Macro for declaring functions (for instances)
#define FUNCS_DECLARE(n)                                                                                            \
    static  ARM_USART_CAPABILITIES  USART##n##_GetCapabilities (void);                                              \
    static  int32_t                 USART##n##_Initialize      (ARM_USART_SignalEvent_t cb_event);                  \
    static  int32_t                 USART##n##_Uninitialize    (void);                                              \
    static  int32_t                 USART##n##_PowerControl    (ARM_POWER_STATE state);                             \
    static  int32_t                 USART##n##_Send            (const void *data, uint32_t num);                    \
    static  int32_t                 USART##n##_Receive         (void *data, uint32_t num);                          \
    static  int32_t                 USART##n##_Transfer        (const void *data_out, void *data_in, uint32_t num); \
    static  uint32_t                USART##n##_GetTxCount      (void);                                              \
    static  uint32_t                USART##n##_GetRxCount      (void);                                              \
    static  int32_t                 USART##n##_Control         (uint32_t control, uint32_t arg);                    \
    static  ARM_USART_STATUS        USART##n##_GetStatus       (void);

// Macro for defining functions (for instances)
#define FUNCS_DEFINE(n)                                                                                                                                                                           \
    static  ARM_USART_CAPABILITIES  USART##n##_GetCapabilities (void)                                              { return USARTn_GetCapabilities (&usart##n##_info); }                          \
    static  int32_t                 USART##n##_Initialize      (ARM_USART_SignalEvent_t cb_event)                  { return USARTn_Initialize      (&usart##n##_info, cb_event); }                \
    static  int32_t                 USART##n##_Uninitialize    (void)                                              { return USARTn_Uninitialize    (&usart##n##_info); }                          \
    static  int32_t                 USART##n##_PowerControl    (ARM_POWER_STATE state)                             { return USARTn_PowerControl    (&usart##n##_info, state); }                   \
    static  int32_t                 USART##n##_Send            (const void *data, uint32_t num)                    { return USARTn_Send            (&usart##n##_info, data, num); }               \
    static  int32_t                 USART##n##_Receive         (void *data, uint32_t num)                          { return USARTn_Receive         (&usart##n##_info, data, num); }               \
    static  int32_t                 USART##n##_Transfer        (const void *data_out, void *data_in, uint32_t num) { return USARTn_Transfer        (&usart##n##_info, data_out, data_in, num); }  \
    static  uint32_t                USART##n##_GetTxCount      (void)                                              { return USARTn_GetTxCount      (&usart##n##_info); }                          \
    static  uint32_t                USART##n##_GetRxCount      (void)                                              { return USARTn_GetRxCount      (&usart##n##_info); }                          \
    static  int32_t                 USART##n##_Control         (uint32_t control, uint32_t arg)                    { return USARTn_Control         (&usart##n##_info, control, arg); }            \
    static  ARM_USART_STATUS        USART##n##_GetStatus       (void)                                              { return USARTn_GetStatus       (&usart##n##_info); }

