OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USART/Driver_USART_UART.c
// Macro for defining driver structures (for instances)
#define USART_DRIVER(n)                   \
    ARM_DRIVER_USART Driver_USART##n =    \
                                          {                                     \
                                                                                USART_GetVersion,                 \
                                                                                USART##n##_GetCapabilities,       \
                                                                                USART##n##_Initialize,            \
                                                                                USART##n##_Uninitialize,          \
                                                                                USART##n##_PowerControl,          \
                                                                                USART##n##_Send,                  \
                                                                                USART##n##_Receive,               \
                                                                                USART##n##_Transfer,              \
                                                                                USART##n##_GetTxCount,            \
                                                                                USART##n##_GetRxCount,            \
                                                                                USART##n##_Control,               \
                                                                                USART##n##_GetStatus,             \
                                                                                USART_SetModemControl,            \
                                                                                USART_GetModemStatus              \
                                          };

// Driver status
typedef struct
{
    uint8_t                       initialized  : 1;       // Initialized status: 0 - not initialized, 1 - initialized
    uint8_t                       powered      : 1;       // Power status:       0 - not powered,     1 - powered
    uint8_t                       configured   : 1;       // Configured status:  0 - not configured,  1 - configured
    uint8_t                       reserved     : 5;       // Reserved (for padding)
} DriverStatus_t;

// Rx trans
typedef struct
{
    uint8_t   *data;
    uint16_t  num_bytes;
    uint16_t  trans_count;
} RX_Trans_t;

// Tx trans
typedef struct
{
    uint8_t   *data;
    uint16_t  num_bytes;
    uint16_t  trans_count;
} TX_Trans_t;

// Instance run-time information (RW)
typedef struct
{
    ARM_USART_SignalEvent_t       cb_event;               // Event callback
    DriverStatus_t                drv_status;             // Driver status
    volatile uint8_t              rx_overflow;            // Receive data overflow detected (cleared on start of next receive operation)
    volatile uint8_t              rx_framing_error;       // Framing error detected on receive (cleared on start of next receive operation)
    volatile uint8_t              rx_parity_error;        // Parity error detected on receive (cleared on start of next receive operation)

    RX_Trans_t                    rx_trans;               // RX trans contrl
    TX_Trans_t                    tx_trans;               // TX trans contrl

    int32_t                       pdma_rx_chan_id;        // PDMA RX channel ID;
    int32_t                       pdma_tx_chan_id;        // PDMA TX channel ID;

} RW_Info_t;

// Instance compile-time information (RO)
// also contains pointer to run-time information
typedef struct
{
    USART_HandleTypeDef           *ptr_USART;
    int32_t                       irq_n;
    uint32_t                      pdma_rx_used;            // use PDMA for RX transfer
    uint32_t                      pdma_tx_used;            // use PDMA for TX transfer
    uint32_t                      pdma_rx_num;             // PDMA RX number
    uint32_t                      pdma_tx_num;             // PDMA TX number
    uint32_t                      pdma_rx_channel;         // PDMA RX channel
    uint32_t                      pdma_tx_channel;         // PDMA TX channel
    uint32_t                      pdma_rx_perip_mode;      // PDMA RX peripheral transfer moode
    uint32_t                      pdma_tx_perip_mode;      // PDMA TX peripheral transfer moode
} RO_Info_t;

typedef struct
{
    const RO_Info_t              *ptr_ro_info;            // Pointer to compile-time information (RO)
    RW_Info_t                    *ptr_rw_info;            // Pointer to run-time information (RW)
} USART_Info_t;


// Information definitions (for instances)
#if (RTE_USART0)
    INFO_DEFINE(0)
#endif
#if (RTE_USART1)
    INFO_DEFINE(1)
#endif
#if (RTE_USART2)
    INFO_DEFINE(2)
#endif
#if (RTE_USART3)
    INFO_DEFINE(3)
#endif
#if (RTE_USART4)
    INFO_DEFINE(4)
#endif
#if (RTE_USART5)
    INFO_DEFINE(5)
#endif
#if (RTE_USART6)
    INFO_DEFINE(6)
#endif
#if (RTE_USART7)
    INFO_DEFINE(7)
#endif
#if (RTE_USART8)
    INFO_DEFINE(8)
#endif
#if (RTE_USART9)
    INFO_DEFINE(9)
#endif

// List of available USART instance infos
static const USART_Info_t *const usart_info_list[] =
{
#if (RTE_USART0)
    &usart0_info,
#endif
#if (RTE_USART1)
    &usart1_info,
#endif
#if (RTE_USART2)
    &usart2_info,
#endif
#if (RTE_USART3)
    &usart3_info,
#endif
#if (RTE_USART4)
    &usart4_info,
#endif
#if (RTE_USART5)
    &usart5_info,
#endif
#if (RTE_USART6)
    &usart6_info,
#endif
#if (RTE_USART7)
    &usart7_info,
#endif
#if (RTE_USART8)
    &usart8_info,
#endif
#if (RTE_USART9)
    &usart9_info,
#endif
    NULL
};

/* Driver Version */
static const ARM_DRIVER_VERSION DriverVersion =
{
    ARM_USART_API_VERSION,
    ARM_USART_DRV_VERSION
};

// Local functions prototypes
static const USART_Info_t       *USART_GetInfo(const USART_HandleTypeDef *huart);
static ARM_DRIVER_VERSION       USART_GetVersion(void);
static ARM_USART_CAPABILITIES   USARTn_GetCapabilities(const USART_Info_t *ptr_usart_info);
static int32_t                  USARTn_Initialize(const USART_Info_t *ptr_usart_info, ARM_USART_SignalEvent_t cb_event);
static int32_t                  USARTn_Uninitialize(const USART_Info_t *ptr_usart_info);
static int32_t                  USARTn_PowerControl(const USART_Info_t *ptr_usart_info, ARM_POWER_STATE state);
static int32_t                  USARTn_Send(const USART_Info_t *ptr_usart_info, const void *data, uint32_t num);
static int32_t                  USARTn_Receive(const USART_Info_t *ptr_usart_info,       void *data, uint32_t num);
static int32_t                  USARTn_Transfer(const USART_Info_t *ptr_usart_info, const void *data_out, void *data_in, uint32_t num);
static uint32_t                 USARTn_GetTxCount(const USART_Info_t *ptr_usart_info);
static uint32_t                 USARTn_GetRxCount(const USART_Info_t *ptr_usart_info);
static int32_t                  USARTn_Control(const USART_Info_t *ptr_usart_info, uint32_t control, uint32_t arg);
static ARM_USART_STATUS         USARTn_GetStatus(const USART_Info_t *ptr_usart_info);
static int32_t                  USART_SetModemControl(ARM_USART_MODEM_CONTROL control);
static ARM_USART_MODEM_STATUS   USART_GetModemStatus(void);

