OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USART/Driver_USART_UART.c
// Local driver functions declarations (for instances)
#if (RTE_USART0)
    FUNCS_DECLARE(0)
#endif
#if (RTE_USART1)
    FUNCS_DECLARE(1)
#endif
#if (RTE_USART2)
    FUNCS_DECLARE(2)
#endif
#if (RTE_USART3)
    FUNCS_DECLARE(3)
#endif
#if (RTE_USART4)
    FUNCS_DECLARE(4)
#endif
#if (RTE_USART5)
    FUNCS_DECLARE(5)
#endif
#if (RTE_USART6)
    FUNCS_DECLARE(6)
#endif
#if (RTE_USART7)
    FUNCS_DECLARE(7)
#endif
#if (RTE_USART8)
    FUNCS_DECLARE(8)
#endif
#if (RTE_USART9)
    FUNCS_DECLARE(9)
#endif

// Auxiliary functions

/**
  \fn          USART_Info_t *USART_GetInfo (const USART_HandleTypeDef *huart)
  \brief       Get pointer to USART_Info_t structure corresponding to specified huart.
  \param[in]   huart    Pointer to USART_HandleTypeDef structure (USART_HandleTypeDef)
  \return      pointer to USART info structure (USART_Info_t)
*/
static const USART_Info_t *USART_GetInfo(const USART_HandleTypeDef *huart)
{
    const USART_Info_t *ptr_usart_info;
    uint8_t    i;

    ptr_usart_info = NULL;
    i           = 0U;

    for (i = 0U; i < (sizeof(usart_info_list) / sizeof(USART_Info_t *)); i++)
    {
        if (usart_info_list[i] != NULL)
        {
            if (usart_info_list[i]->ptr_ro_info->ptr_USART == huart)
            {
                ptr_usart_info = usart_info_list[i];
                break;
            }
        }
    }

    return ptr_usart_info;
}

static void PDMA_TX_CB_Handler(void *ptr_priv, uint32_t event)
{
    USART_Info_t *ptr_usart_info = (USART_Info_t *)ptr_priv;
    RW_Info_t *ptr_rw_info = ptr_usart_info->ptr_rw_info;
    TX_Trans_t *ptr_tx_trans = &ptr_rw_info->tx_trans;

    /* Disable UART Tx PDMA0 function */
    UART_DISABLE_INT(ptr_usart_info->ptr_ro_info->ptr_USART, UART_INTEN_TXPDMAEN_Msk);

    if (event & (NU_PDMA_EVENT_TRANSFER_DONE | NU_PDMA_EVENT_ABORT))
    {
        if (event & (NU_PDMA_EVENT_TRANSFER_DONE))
        {
            ptr_tx_trans->trans_count = ptr_tx_trans->num_bytes;
        }
        else
        {
            ptr_tx_trans->trans_count =  nu_pdma_transferred_byte_get(ptr_rw_info->pdma_tx_chan_id, ptr_tx_trans->num_bytes);
        }

        if (ptr_rw_info->cb_event)
        {
            /* Wait the STOP bit of the last byte has been transmitted. */
            UART_WAIT_TX_EMPTY(ptr_usart_info->ptr_ro_info->ptr_USART);
            ptr_rw_info->cb_event(ARM_USART_EVENT_TX_COMPLETE | ARM_USART_EVENT_SEND_COMPLETE);
        }
    }
}

static void PDMA_RX_CB_Handler(void *ptr_priv, uint32_t event)
{
    USART_Info_t *ptr_usart_info = (USART_Info_t *)ptr_priv;
    RW_Info_t *ptr_rw_info = ptr_usart_info->ptr_rw_info;
    RX_Trans_t *ptr_rx_trans = &ptr_rw_info->rx_trans;

    /* Disable UART Tx PDMA0 function */
    UART_DISABLE_INT(ptr_usart_info->ptr_ro_info->ptr_USART, UART_INTEN_RXPDMAEN_Msk);

    if (event & (NU_PDMA_EVENT_TRANSFER_DONE | NU_PDMA_EVENT_ABORT))
    {
        if (event & (NU_PDMA_EVENT_TRANSFER_DONE))
        {
            ptr_rx_trans->trans_count = ptr_rx_trans->num_bytes;
        }
        else
        {
            ptr_rx_trans->trans_count =  nu_pdma_transferred_byte_get(ptr_rw_info->pdma_rx_chan_id, ptr_rx_trans->num_bytes);
        }

        if (ptr_rw_info->cb_event)
        {
            ptr_rw_info->cb_event(ARM_USART_EVENT_RECEIVE_COMPLETE);
        }
    }
}


// Driver functions ************************************************************

/**
  \fn          ARM_DRIVER_VERSION USART_GetVersion (void)
  \brief       Get driver version.
  \return      \ref ARM_DRIVER_VERSION
*/
static ARM_DRIVER_VERSION USART_GetVersion(void)
{
    return DriverVersion;
}

/**
  \fn          ARM_USART_CAPABILITIES USARTn_GetCapabilities (const USART_Info_t * const ptr_usart_info)
  \brief       Get driver capabilities.
  \param[in]   ptr_usart_info     Pointer to USART RO info structure (USART_Info_t)
  \return      \ref ARM_USART_CAPABILITIES
*/
static ARM_USART_CAPABILITIES USARTn_GetCapabilities(const USART_Info_t *ptr_usart_info)
{
    (void)ptr_usart_info;
    ARM_USART_CAPABILITIES driver_capabilities;

    // Clear capabilities structure
    memset(&driver_capabilities, 0, sizeof(ARM_USART_CAPABILITIES));

    // Load capability fields different than 0
    driver_capabilities.asynchronous = 1U;
    driver_capabilities.single_wire = 1U;
    driver_capabilities.event_tx_complete = 1U;
    driver_capabilities.event_rx_timeout = 1U;
    driver_capabilities.flow_control_rts = 1U;
    driver_capabilities.flow_control_cts = 1U;
    driver_capabilities.rts = 1U;
    driver_capabilities.cts = 1U;
    return driver_capabilities;
}

/**
  \fn          int32_t USARTn_Initialize (const USART_Info_t * const ptr_usart_info, ARM_USART_SignalEvent_t cb_event)
  \brief       Initialize USART Interface.
  \param[in]   ptr_usart_info     Pointer to USART RO info structure (USART_Info_t)
  \param[in]   cb_event        Pointer to \ref ARM_USART_SignalEvent
  \return      \ref execution_status
*/
static int32_t USARTn_Initialize(const USART_Info_t *ptr_usart_info, ARM_USART_SignalEvent_t cb_event)
{

    RW_Info_t *ptr_rw_info = ptr_usart_info->ptr_rw_info;

    if (ptr_usart_info->ptr_ro_info->pdma_rx_used)
    {
        if ((ptr_rw_info->pdma_rx_chan_id >= 0) && ((uint32_t)ptr_rw_info->pdma_rx_chan_id < PDMA_CH_MAX * PDMA_CNT))
        {
            nu_pdma_channel_terminate(ptr_rw_info->pdma_rx_chan_id);
            nu_pdma_channel_free(ptr_rw_info->pdma_rx_chan_id);
        }
    }

    if (ptr_usart_info->ptr_ro_info->pdma_tx_used)
    {
        if ((ptr_rw_info->pdma_tx_chan_id >= 0) && ((uint32_t)ptr_rw_info->pdma_tx_chan_id < PDMA_CH_MAX * PDMA_CNT))
        {
            nu_pdma_channel_terminate(ptr_rw_info->pdma_tx_chan_id);
            nu_pdma_channel_free(ptr_rw_info->pdma_tx_chan_id);
        }
    }

    // Clear run-time info
    memset((void *)ptr_rw_info, 0, sizeof(RW_Info_t));

    ptr_rw_info->pdma_rx_chan_id = -1;
    ptr_rw_info->pdma_tx_chan_id = -1;

    // Register callback function
    ptr_rw_info->cb_event = cb_event;

    // Set driver status to initialized
    ptr_rw_info->drv_status.initialized = 1U;

    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USARTn_Uninitialize (const USART_Info_t *ptr_usart_info)
  \brief       De-initialize USART Interface.
  \param[in]   ptr_usart_info     Pointer to USART info structure (USART_Info_t)
  \return      \ref execution_status
*/
static int32_t USARTn_Uninitialize(const USART_Info_t *ptr_usart_info)
{

