OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USART/Driver_USART_UART.c
    RW_Info_t *ptr_rw_info = ptr_usart_info->ptr_rw_info;

    if (ptr_rw_info->drv_status.powered != 0U)
    {
        // If peripheral is powered, power off the peripheral
        (void)USARTn_PowerControl(ptr_usart_info, ARM_POWER_OFF);
    }

    // Clear run-time info
    memset((void *)ptr_rw_info, 0, sizeof(RW_Info_t));

    ptr_rw_info->pdma_rx_chan_id = -1;
    ptr_rw_info->pdma_tx_chan_id = -1;

    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USARTn_PowerControl (const USART_Info_t *ptr_usart_info, ARM_POWER_STATE state)
  \brief       Control USART Interface Power.
  \param[in]   ptr_usart_info     Pointer to USART info structure (USART_Info_t)
  \param[in]   state           Power state
  \return      \ref execution_status
*/
static int32_t USARTn_PowerControl(const USART_Info_t *ptr_usart_info, ARM_POWER_STATE state)
{

    RW_Info_t *ptr_rw_info = ptr_usart_info->ptr_rw_info;
    const RO_Info_t *ptr_ro_info = ptr_usart_info->ptr_ro_info;

    switch (state)
    {
        case ARM_POWER_FULL:
            if (ptr_rw_info->drv_status.initialized == 0U)
            {
                return ARM_DRIVER_ERROR;
            }

            // Clear communication error status
            ptr_rw_info->rx_overflow      = 0U;
            ptr_rw_info->rx_framing_error = 0U;
            ptr_rw_info->rx_parity_error  = 0U;

            if ((ptr_ro_info->pdma_tx_used) || (ptr_ro_info->pdma_rx_used))
            {
                CLK_EnableModuleClock(PDMA0_MODULE);
                CLK_EnableModuleClock(PDMA1_MODULE);
            }

            // Initialize interrupt and peripheral
            UART_Open(ptr_ro_info->ptr_USART, 0);
            NVIC_EnableIRQ(ptr_ro_info->irq_n);

            // Allocate PDMA RX channel if PDMA RX used
            if ((ptr_ro_info->pdma_rx_used) && (ptr_rw_info->pdma_rx_chan_id == -1))
            {
                ptr_rw_info->pdma_rx_chan_id = nu_pdma_channel_allocate(
                                                   ptr_ro_info->pdma_rx_perip_mode,
                                                   ptr_ro_info->pdma_rx_num,
                                                   ptr_ro_info->pdma_rx_channel
                                               );
            }

            // Allocate PDMA TX channel if PDMA TX used
            if ((ptr_ro_info->pdma_tx_used) && (ptr_rw_info->pdma_tx_chan_id == -1))
            {
                ptr_rw_info->pdma_tx_chan_id = nu_pdma_channel_allocate(
                                                   ptr_ro_info->pdma_tx_perip_mode,
                                                   ptr_ro_info->pdma_tx_num,
                                                   ptr_ro_info->pdma_tx_channel
                                               );
            }

            // Set driver status to powered
            ptr_rw_info->drv_status.powered = 1U;
            break;

        case ARM_POWER_OFF:

            // If send operation is in progress, abort it
            if (USARTn_GetStatus(ptr_usart_info).tx_busy != 0U)
            {
                (void)USARTn_Control(ptr_usart_info, ARM_USART_ABORT_SEND, 0U);
            }

            // If receive operation is in progress, abort it
            if (USARTn_GetStatus(ptr_usart_info).rx_busy != 0U)
            {
                (void)USARTn_Control(ptr_usart_info, ARM_USART_ABORT_RECEIVE, 0U);
            }

            // De-initialize interrupts and peripheral
            UART_Close(ptr_ro_info->ptr_USART);
            NVIC_DisableIRQ(ptr_ro_info->irq_n);

            // Free PDMA channels
            if (ptr_rw_info->pdma_rx_chan_id != -1)
            {
                nu_pdma_channel_free(ptr_rw_info->pdma_rx_chan_id);
                ptr_rw_info->pdma_rx_chan_id = -1;
            }

            if (ptr_rw_info->pdma_tx_chan_id != -1)
            {
                nu_pdma_channel_free(ptr_rw_info->pdma_tx_chan_id);
                ptr_rw_info->pdma_tx_chan_id = -1;
            }

            // Set driver status to not powered
            ptr_rw_info->drv_status.powered = 0U;

            // Clear communication error status
            ptr_rw_info->rx_overflow      = 0U;
            ptr_rw_info->rx_framing_error = 0U;
            ptr_rw_info->rx_parity_error  = 0U;
            break;

        case ARM_POWER_LOW:
            return ARM_DRIVER_ERROR_UNSUPPORTED;

        default:
            return ARM_DRIVER_ERROR_PARAMETER;
    }

    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USARTn_Send (const USART_Info_t * const ptr_usart_info, const void *data, uint32_t num)
  \brief       Start sending data to USART transmitter.
  \param[in]   ptr_usart_info     Pointer to USART info structure (USART_Info_t)
  \param[in]   data            Pointer to buffer with data to send to USART transmitter
  \param[in]   num             Number of data items to send
  \return      \ref execution_status
*/
static int32_t USARTn_Send(const USART_Info_t *ptr_usart_info, const void *data, uint32_t num)
{
    ARM_USART_STATUS usart_status;
    RW_Info_t *ptr_rw_info = ptr_usart_info->ptr_rw_info;
    TX_Trans_t *ptr_tx_trans = &ptr_rw_info->tx_trans;

    if ((data == NULL) || (num == 0U) || (num > (uint32_t)UINT16_MAX))
    {
        // If any parameter is invalid
        return ARM_DRIVER_ERROR_PARAMETER;
    }

    if (ptr_rw_info->drv_status.configured == 0U)
    {
        return ARM_DRIVER_ERROR;
    }

    usart_status = USARTn_GetStatus(ptr_usart_info);

    if (usart_status.tx_busy)
        return ARM_DRIVER_ERROR_BUSY;

    ptr_tx_trans->data = (uint8_t *)data;
    ptr_tx_trans->num_bytes = num;
    ptr_tx_trans->trans_count = 0;

    if (ptr_rw_info->pdma_tx_chan_id != -1)
    {
        //Use PDMA transfer mode
        struct nu_pdma_chn_cb pdma_chn_cb;

        pdma_chn_cb.m_eCBType = eCBType_Event;
        pdma_chn_cb.m_pfnCBHandler = PDMA_TX_CB_Handler;
        pdma_chn_cb.m_pvUserData = (void *)ptr_usart_info;

        //Use PDMA transfer mode
        nu_pdma_filtering_set(ptr_rw_info->pdma_tx_chan_id, NU_PDMA_EVENT_TRANSFER_DONE | NU_PDMA_EVENT_ABORT);
        nu_pdma_callback_register(ptr_rw_info->pdma_tx_chan_id, &pdma_chn_cb);
        nu_pdma_transfer(ptr_rw_info->pdma_tx_chan_id, 8, (uint32_t)ptr_tx_trans->data, (uint32_t)&ptr_usart_info->ptr_ro_info->ptr_USART->DAT, ptr_tx_trans->num_bytes, 0);
        UART_EnableInt(ptr_usart_info->ptr_ro_info->ptr_USART, (UART_INTEN_TXPDMAEN_Msk | UART_INTEN_BUFERRIEN_Msk));
    }
    else
    {
        //Use IRQ transfer mode
        UART_EnableInt(ptr_usart_info->ptr_ro_info->ptr_USART, (UART_INTEN_THREIEN_Msk | UART_INTEN_BUFERRIEN_Msk));
    }

    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USARTn_Receive (const USART_Info_t *ptr_usart_info, void *data, uint32_t num)
  \brief       Start receiving data from USART receiver.
  \param[in]   ptr_usart_info  Pointer to USART info structure (USART_Info_t)
  \param[out]  data            Pointer to buffer for data to receive from USART receiver
  \param[in]   num             Number of data items to receive
  \return      \ref execution_status
*/
static int32_t USARTn_Receive(const USART_Info_t *ptr_usart_info, void *data, uint32_t num)
{
    ARM_USART_STATUS usart_status;
    RW_Info_t *ptr_rw_info = ptr_usart_info->ptr_rw_info;
    RX_Trans_t *ptr_rx_trans = &ptr_rw_info->rx_trans;

    if ((data == NULL) || (num == 0U) || (num > (uint32_t)UINT16_MAX))
    {
        // If any parameter is invalid
        return ARM_DRIVER_ERROR_PARAMETER;
    }

    if (ptr_rw_info->drv_status.configured == 0U)
    {
        return ARM_DRIVER_ERROR;
    }

