OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USART/Driver_USART_UART.c
    usart_status = USARTn_GetStatus(ptr_usart_info);

    if (usart_status.rx_busy)
        return ARM_DRIVER_ERROR_BUSY;

    ptr_rx_trans->data = (uint8_t *)data;
    ptr_rx_trans->num_bytes = num;
    ptr_rx_trans->trans_count = 0;

    // Clear communication error status
    ptr_rw_info->rx_overflow      = 0U;
    ptr_rw_info->rx_framing_error = 0U;
    ptr_rw_info->rx_parity_error  = 0U;

    UART_RESET_RXFIFO(ptr_usart_info->ptr_ro_info->ptr_USART);

    if (ptr_rw_info->pdma_rx_chan_id != -1)
    {
        //Use PDMA transfer mode
        struct nu_pdma_chn_cb pdma_chn_cb;

        pdma_chn_cb.m_eCBType = eCBType_Event;
        pdma_chn_cb.m_pfnCBHandler = PDMA_RX_CB_Handler;
        pdma_chn_cb.m_pvUserData = (void *)ptr_usart_info;

        //Use PDMA transfer mode
        nu_pdma_filtering_set(ptr_rw_info->pdma_rx_chan_id, NU_PDMA_EVENT_TRANSFER_DONE | NU_PDMA_EVENT_ABORT);
        nu_pdma_callback_register(ptr_rw_info->pdma_rx_chan_id, &pdma_chn_cb);
        nu_pdma_transfer(ptr_rw_info->pdma_rx_chan_id, 8, (uint32_t)&ptr_usart_info->ptr_ro_info->ptr_USART->DAT, (uint32_t)ptr_rx_trans->data, ptr_rx_trans->num_bytes, 0);
        UART_EnableInt(ptr_usart_info->ptr_ro_info->ptr_USART, (UART_INTEN_RXPDMAEN_Msk | UART_INTEN_RLSIEN_Msk | UART_INTEN_BUFERRIEN_Msk | UART_INTEN_TOCNTEN_Msk | UART_INTEN_RXTOIEN_Msk));
    }
    else
    {
        //Use IRQ transfer mode
        UART_EnableInt(ptr_usart_info->ptr_ro_info->ptr_USART, (UART_INTEN_RDAIEN_Msk | UART_INTEN_RLSIEN_Msk | UART_INTEN_BUFERRIEN_Msk | UART_INTEN_TOCNTEN_Msk | UART_INTEN_RXTOIEN_Msk));
    }

    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USARTn_Transfer (const USART_Info_t *ptr_usart_info, const void *data_out, void *data_in, uint32_t num)
  \brief       Start sending/receiving data to/from USART transmitter/receiver.
  \param[in]   ptr_usart_info  Pointer to USART info structure (USART_Info_t)
  \param[in]   data_out        Pointer to buffer with data to send to USART transmitter
  \param[out]  data_in         Pointer to buffer for data to receive from USART receiver
  \param[in]   num             Number of data items to transfer
  \return      \ref execution_status
*/
static int32_t USARTn_Transfer(const USART_Info_t *ptr_usart_info, const void *data_out, void *data_in, uint32_t num)
{
    (void)data_out;
    (void)data_in;
    (void)num;
    (void)ptr_usart_info;

    if (ptr_usart_info->ptr_rw_info->drv_status.configured == 0U)
    {
        return ARM_DRIVER_ERROR;
    }

    // Supported only in Synchronous mode
    return ARM_DRIVER_ERROR_UNSUPPORTED;
}


/**
  \fn          uint32_t USARTn_GetTxCount (const USART_Info_t *ptr_usart_info)
  \brief       Get transmitted data count.
  \param[in]   ptr_usart_info     Pointer to USART info structure (USART_Info_t)
  \return      number of data items transmitted
*/
static uint32_t USARTn_GetTxCount(const USART_Info_t *ptr_usart_info)
{
    RW_Info_t *ptr_rw_info = ptr_usart_info->ptr_rw_info;
    TX_Trans_t *ptr_tx_trans = &ptr_rw_info->tx_trans;

    if (ptr_rw_info->drv_status.powered == 0U)
    {
        return 0U;
    }

    if (ptr_rw_info->pdma_tx_chan_id != -1)
    {
        ptr_tx_trans->trans_count = nu_pdma_transferred_byte_get(ptr_rw_info->pdma_tx_chan_id, ptr_tx_trans->num_bytes);
    }

    return (uint32_t)ptr_rw_info->tx_trans.trans_count;
}

/**
  \fn          uint32_t USARTn_GetRxCount (const USART_Info_t *ptr_usart_info)
  \brief       Get received data count.
  \param[in]   ptr_usart_info     Pointer to USART info structure (USART_Info_t)
  \return      number of data items received
*/
static uint32_t USARTn_GetRxCount(const USART_Info_t *ptr_usart_info)
{
    RW_Info_t *ptr_rw_info = ptr_usart_info->ptr_rw_info;
    RX_Trans_t *ptr_rx_trans = &ptr_rw_info->rx_trans;

    if (ptr_rw_info->drv_status.powered == 0U)
    {
        return 0U;
    }

    if (ptr_rw_info->pdma_rx_chan_id != -1)
    {
        ptr_rx_trans->trans_count = nu_pdma_transferred_byte_get(ptr_rw_info->pdma_rx_chan_id, ptr_rx_trans->num_bytes);
    }

    return (uint32_t)ptr_rw_info->rx_trans.trans_count;
}

/**
  \fn          int32_t USARTn_Control (const USART_Info_t *ptr_usart_info, uint32_t control, uint32_t arg)
  \brief       Control USART Interface.
  \param[in]   ptr_usart_info     Pointer to USART info structure (USART_Info_t)
  \param[in]   control         Operation
  \param[in]   arg             Argument of operation (optional)
  \return      common \ref execution_status and driver specific \ref usart_execution_status
*/
static int32_t USARTn_Control(const USART_Info_t *ptr_usart_info, uint32_t control, uint32_t arg)
{
    ARM_USART_STATUS status;
    uint32_t         word_len;
    uint32_t         parity = UART_PARITY_NONE;
    uint32_t         stop_bits = UART_STOP_BIT_1;
    uint32_t         baud_rate = 0;
    RW_Info_t *ptr_rw_info = ptr_usart_info->ptr_rw_info;

    if (ptr_usart_info->ptr_rw_info->drv_status.powered == 0U)
    {
        return ARM_DRIVER_ERROR;
    }

    // Special handling for Abort Send command
    if ((control & ARM_USART_CONTROL_Msk) == ARM_USART_ABORT_SEND)
    {
        UART_DisableInt(ptr_usart_info->ptr_ro_info->ptr_USART, (UART_INTEN_THREIEN_Msk | UART_INTEN_BUFERRIEN_Msk));

        if (ptr_rw_info->pdma_tx_chan_id != -1)
        {
            nu_pdma_channel_terminate(ptr_rw_info->pdma_tx_chan_id);
        }

        ptr_rw_info->tx_trans.data = NULL;
        ptr_rw_info->tx_trans.num_bytes = 0;
        ptr_rw_info->tx_trans.trans_count = 0;
        return ARM_DRIVER_OK;
    }

    // Special handling for Abort Receive command
    if ((control & ARM_USART_CONTROL_Msk) == ARM_USART_ABORT_RECEIVE)
    {
        UART_DisableInt(ptr_usart_info->ptr_ro_info->ptr_USART, (UART_INTEN_RDAIEN_Msk | UART_INTEN_RLSIEN_Msk | UART_INTEN_BUFERRIEN_Msk | UART_INTEN_TOCNTEN_Msk | UART_INTEN_RXTOIEN_Msk));

        if (ptr_rw_info->pdma_rx_chan_id != -1)
        {
            nu_pdma_channel_terminate(ptr_rw_info->pdma_rx_chan_id);
        }

        ptr_rw_info->rx_trans.data = NULL;
        ptr_rw_info->rx_trans.num_bytes = 0;
        ptr_rw_info->rx_trans.trans_count = 0;
        return ARM_DRIVER_OK;
    }

    // Check if peripheral is busy
    status = USARTn_GetStatus(ptr_usart_info);

    if ((status.tx_busy != 0U) || (status.rx_busy != 0U))
    {
        return ARM_DRIVER_ERROR_BUSY;
    }


