OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USART/Driver_USART_UART.c
    switch (control & ARM_USART_CONTROL_Msk)      // --- Control: Mode and Miscellaneous
    {
        // --- Control Mode
        case ARM_USART_MODE_ASYNCHRONOUS:           // Mode: Asynchronous
            ptr_rw_info->drv_status.configured = 0U;
            break;                                    // Continue configuring parameters after this switch block

        case ARM_USART_MODE_SYNCHRONOUS_MASTER:     // Mode: Synchronous Master
        case ARM_USART_MODE_SYNCHRONOUS_SLAVE:      // Mode: Synchronous Slave
        case ARM_USART_MODE_SINGLE_WIRE:            // Mode: Single-wire
        case ARM_USART_MODE_IRDA:                   // Mode: IrDA
        case ARM_USART_MODE_SMART_CARD:             // Mode: Smart Card
            return ARM_USART_ERROR_MODE;

        // --- Control Miscellaneous
        case ARM_USART_CONTROL_TX:                  // Transmitter; arg: 0=disabled, 1=enabled
            if (arg != 0U)
            {
                // Enable transmitter
                //UART_ENABLE_INT(ptr_usart_info->ptr_ro_info->ptr_USART, UART_INTEN_THREIEN_Msk);
            }
            else
            {
                // Disable transmitter
                UART_DISABLE_INT(ptr_usart_info->ptr_ro_info->ptr_USART, (UART_INTEN_THREIEN_Msk | UART_INTEN_TXPDMAEN_Msk));
            }

            return ARM_DRIVER_OK;

        case ARM_USART_CONTROL_RX:                  // Receiver; arg: 0=disabled, 1=enabled
            if (arg != 0U)
            {
                // Enable receiver
                //UART_ENABLE_INT(ptr_usart_info->ptr_ro_info->ptr_USART, UART_INTEN_RDAIEN_Msk);
            }
            else
            {
                // Disable receiver
                UART_DISABLE_INT(ptr_usart_info->ptr_ro_info->ptr_USART, (UART_INTEN_RDAIEN_Msk | UART_INTEN_RXPDMAEN_Msk));
            }

            return ARM_DRIVER_OK;

        case ARM_USART_SET_DEFAULT_TX_VALUE:        // Set default Transmit value
        case ARM_USART_SET_IRDA_PULSE:              // Set IrDA Pulse in ns
        case ARM_USART_SET_SMART_CARD_GUARD_TIME:   // Set Smart Card Guard Time
        case ARM_USART_SET_SMART_CARD_CLOCK:        // Set Smart Card Clock in Hz
        case ARM_USART_CONTROL_SMART_CARD_NACK:     // Smart Card NACK generation
        case ARM_USART_CONTROL_BREAK:               // Continuous Break transmission
        case ARM_USART_ABORT_TRANSFER:              // Abort ARM_USART_Transfer
            return ARM_DRIVER_ERROR_UNSUPPORTED;

        default:                                    // Unknown Control
            return ARM_DRIVER_ERROR_PARAMETER;
    }

    // Configure all other parameters if command was to set Asynchronous mode (ARM_USART_MODE_ASYNCHRONOUS)

    switch (control & ARM_USART_DATA_BITS_Msk)    // --- Mode Parameters: Data Bits
    {
        case ARM_USART_DATA_BITS_6:                 // Data bits: 6
            word_len = UART_WORD_LEN_6;
            break;

        case ARM_USART_DATA_BITS_7:                 // Data bits: 7
            word_len = UART_WORD_LEN_7;
            break;

        case ARM_USART_DATA_BITS_8:                 // Data bits: 8
            word_len = UART_WORD_LEN_8;
            break;

        default:
            return ARM_USART_ERROR_DATA_BITS;
    }

    // Determine number of parity bits used
    switch (control & ARM_USART_PARITY_Msk)       // --- Mode Parameters: Parity
    {
        case ARM_USART_PARITY_NONE:                 // Parity: none
            parity = UART_PARITY_NONE;
            break;

        case ARM_USART_PARITY_EVEN:                 // Parity: even
            parity = UART_PARITY_EVEN;
            break;

        case ARM_USART_PARITY_ODD:                  // Parity: odd
            parity = UART_PARITY_ODD;
            break;

        default:
            return ARM_USART_ERROR_PARITY;
    }

    switch (control & ARM_USART_STOP_BITS_Msk)    // --- Mode Parameters: Stop Bits
    {
        case ARM_USART_STOP_BITS_1:                 // Stop Bits: 1
            stop_bits = UART_STOP_BIT_1;
            break;

        case ARM_USART_STOP_BITS_2:                 // Stop Bits: 2
            stop_bits = UART_STOP_BIT_2;
            break;

        case ARM_USART_STOP_BITS_1_5:               // Stop Bits: 1.5
            stop_bits = UART_STOP_BIT_1_5;
            break;

        default:
            return ARM_USART_ERROR_STOP_BITS;
    }

    switch (control & ARM_USART_FLOW_CONTROL_Msk)   // --- Mode Parameters: Flow Control
    {
        case ARM_USART_FLOW_CONTROL_NONE:             // Flow Control: none
            UART_DisableFlowCtrl(ptr_usart_info->ptr_ro_info->ptr_USART);
            break;

        case ARM_USART_FLOW_CONTROL_RTS:              // Flow Control: RTS
            /* Set RTS pin output is low level active */
            ptr_usart_info->ptr_ro_info->ptr_USART->MODEM |= UART_MODEM_RTSACTLV_Msk;

            /* Set RTS auto flow control enable */
            ptr_usart_info->ptr_ro_info->ptr_USART->INTEN |= UART_INTEN_ATORTSEN_Msk;

            break;

        case ARM_USART_FLOW_CONTROL_CTS:              // Flow Control: CTS
            /* Set CTS pin input is low level active */
            ptr_usart_info->ptr_ro_info->ptr_USART->MODEMSTS |= UART_MODEMSTS_CTSACTLV_Msk;

            /* Set CTS auto flow control enable */
            ptr_usart_info->ptr_ro_info->ptr_USART->INTEN |= UART_INTEN_ATOCTSEN_Msk;
            break;

        case ARM_USART_FLOW_CONTROL_RTS_CTS:          // Flow Control: RTS/CTS
            /* Enable auto flow control function(RTS/CTS) */
            UART_EnableFlowCtrl(ptr_usart_info->ptr_ro_info->ptr_USART);
            break;

        default:
            return ARM_USART_ERROR_FLOW_CONTROL;
    }

    baud_rate = arg;

    // Reconfigure USART
    UART_SetLineConfig(ptr_usart_info->ptr_ro_info->ptr_USART, baud_rate, word_len, parity, stop_bits);

    // Set driver status to configured
    ptr_rw_info->drv_status.configured = 1U;
    return ARM_DRIVER_OK;
}

/**
  \fn          ARM_USART_STATUS USARTn_GetStatus (const USART_Info_t * const ptr_usart_info)
  \brief       Get USART status.
  \param[in]   ptr_usart_info     Pointer to USART info structure (USART_Info_t)
  \return      USART status \ref ARM_USART_STATUS
*/
static ARM_USART_STATUS USARTn_GetStatus(const USART_Info_t *ptr_usart_info)
{
    ARM_USART_STATUS status;
    RW_Info_t *ptr_rw_info = ptr_usart_info->ptr_rw_info;

