OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USART/Driver_USART_UART.c
    // Clear status structure
    memset(&status, 0, sizeof(ARM_USART_STATUS));

    if (ptr_rw_info->tx_trans.num_bytes != ptr_rw_info->tx_trans.trans_count)
        status.tx_busy = 1U;

    if (ptr_rw_info->rx_trans.num_bytes != ptr_rw_info->rx_trans.trans_count)
        status.rx_busy = 1U;

    // Process additionally handled communication information
    if (ptr_rw_info->rx_overflow != 0U)
    {
        status.rx_overflow = 1U;
    }

    if (ptr_rw_info->rx_framing_error != 0U)
    {
        status.rx_framing_error = 1U;
    }

    if (ptr_rw_info->rx_parity_error != 0U)
    {
        status.rx_parity_error = 1U;
    }

    return status;
}

/**
  \fn          int32_t USART_SetModemControl (ARM_USART_MODEM_CONTROL control)
  \brief       Set USART Modem Control line state.
  \param[in]   control  \ref ARM_USART_MODEM_CONTROL
  \return      \ref execution_status
*/
static int32_t USART_SetModemControl(ARM_USART_MODEM_CONTROL control)
{
    (void)control;

    // Manual control of modem control lines is not supported
    return ARM_DRIVER_ERROR_UNSUPPORTED;
}

/**
  \fn          ARM_USART_MODEM_STATUS USART_GetModemStatus (void)
  \brief       Get USART Modem Status lines state.
  \return      modem status \ref ARM_USART_MODEM_STATUS
*/
static ARM_USART_MODEM_STATUS USART_GetModemStatus(void)
{
    ARM_USART_MODEM_STATUS modem_status;

    // Retrieving modem control lines status information is supported
    memset(&modem_status, 0, sizeof(ARM_USART_MODEM_STATUS));

    return modem_status;
}

// IRQ handler
void UARTn_IRQHandler(const USART_Info_t *ptr_usart_info)
{
    USART_HandleTypeDef *huart = ptr_usart_info->ptr_ro_info->ptr_USART;
    RW_Info_t *ptr_rw_info = ptr_usart_info->ptr_rw_info;

    uint32_t u32IRQStatus = huart->INTSTS;

    if (UART_GET_INT_FLAG(huart, UART_INTSTS_RDAINT_Msk))
    {
        RX_Trans_t *ptr_rx_trans;
        uint8_t u8InChar = 0xFF;
        ptr_rx_trans = &ptr_rw_info->rx_trans;

        /* Get all the input characters */
        while (UART_IS_RX_READY(huart))
        {
            /* Get the character from UART Buffer */
            u8InChar = UART_READ(huart);

            /* Put buffer */
            if (ptr_rx_trans->data)
            {
                if (ptr_rx_trans->num_bytes > ptr_rx_trans->trans_count)
                {
                    ptr_rx_trans->data[ptr_rx_trans->trans_count] = u8InChar;
                    ptr_rx_trans->trans_count ++;
                }

                if (ptr_rx_trans->num_bytes == ptr_rx_trans->trans_count)
                {
                    if (ptr_rw_info->cb_event)
                        ptr_rw_info->cb_event(ARM_USART_EVENT_RECEIVE_COMPLETE);
                }
            }
        }
    }

    if (UART_GET_INT_FLAG(huart, UART_INTSTS_THREINT_Msk))
    {
        TX_Trans_t *ptr_tx_trans;
        uint8_t u8OutChar;
        ptr_tx_trans = &ptr_rw_info->tx_trans;

        if (!UART_IS_TX_FULL(huart))
        {
            if (ptr_tx_trans->data)
            {
                if (ptr_tx_trans->num_bytes > ptr_tx_trans->trans_count)
                {
                    u8OutChar = ptr_tx_trans->data[ptr_tx_trans->trans_count];
                    ptr_tx_trans->trans_count++;
                    UART_WRITE(huart, u8OutChar);
                }

                if (ptr_tx_trans->num_bytes == ptr_tx_trans->trans_count)
                {
                    UART_DisableInt(huart, (UART_INTEN_THREIEN_Msk));

                    if (ptr_rw_info->cb_event)
                    {
                        /* Wait the STOP bit of the last byte has been transmitted. */
                        UART_WAIT_TX_EMPTY(huart);
                        ptr_rw_info->cb_event(ARM_USART_EVENT_TX_COMPLETE | ARM_USART_EVENT_SEND_COMPLETE);
                    }
                }
            }
        }
    }

    uint32_t   event = 0;

    if (u32IRQStatus & UART_INTSTS_HWTOINT_Msk)
    {
        event |= ARM_USART_EVENT_RX_TIMEOUT;
    }

    if (u32IRQStatus & UART_INTSTS_RXTOINT_Msk)
    {
        event |= ARM_USART_EVENT_RX_TIMEOUT;
    }

    if (huart->FIFOSTS & (UART_FIFOSTS_FEF_Msk))
    {
        event |= ARM_USART_EVENT_RX_FRAMING_ERROR;
        ptr_rw_info->rx_framing_error = 1U;
    }

    if (huart->FIFOSTS & (UART_FIFOSTS_PEF_Msk))
    {
        event |= ARM_USART_EVENT_RX_PARITY_ERROR;
        ptr_rw_info->rx_parity_error = 1U;
    }

    if (huart->FIFOSTS & (UART_FIFOSTS_RXOVIF_Msk))
    {
        event |= ARM_USART_EVENT_RX_OVERFLOW;
        ptr_rw_info->rx_overflow = 1U;
    }

    if ((ptr_rw_info->cb_event != NULL) && (event != 0U))
    {
        ptr_rw_info->cb_event(event);
    }

    //Clear RLSINT and BUFERRINT flag
    if (huart->FIFOSTS & (UART_FIFOSTS_BIF_Msk | UART_FIFOSTS_FEF_Msk | UART_FIFOSTS_PEF_Msk | UART_FIFOSTS_RXOVIF_Msk))
    {
        UART_ClearIntFlag(huart, (UART_INTSTS_RLSINT_Msk | UART_INTSTS_BUFERRINT_Msk));
    }

    if (UART_GET_INT_FLAG(huart, UART_INTSTS_BUFERRINT_Msk))
    {
        UART_ClearIntFlag(huart, (UART_INTSTS_BUFERRINT_Msk));
    }
}

#if (RTE_USART0)
NVT_ITCM void UART0_IRQHandler(void)
{
    const USART_Info_t *ptr_usart_info = NULL;
    ptr_usart_info = USART_GetInfo(UART0);

    if (ptr_usart_info)
    {
        UARTn_IRQHandler(ptr_usart_info);
    }
}

#endif

#if (RTE_USART1)
NVT_ITCM void UART1_IRQHandler(void)
{
    const USART_Info_t *prt_usart_info = NULL;
    prt_usart_info = USART_GetInfo(UART1);

    if (prt_usart_info)
    {
        UARTn_IRQHandler(prt_usart_info);
    }
}

#endif

#if (RTE_USART2)
NVT_ITCM void UART2_IRQHandler(void)
{
    const USART_Info_t *prt_usart_info = NULL;
    prt_usart_info = USART_GetInfo(UART2);

    if (prt_usart_info)
    {
        UARTn_IRQHandler(prt_usart_info);
    }
}

#endif

#if (RTE_USART3)
NVT_ITCM void UART3_IRQHandler(void)
{
    const USART_Info_t *prt_usart_info = NULL;
    prt_usart_info = USART_GetInfo(UART3);

    if (prt_usart_info)
    {
        UARTn_IRQHandler(prt_usart_info);
    }
}

#endif

#if (RTE_USART4)
NVT_ITCM void UART4_IRQHandler(void)
{
    const USART_Info_t *prt_usart_info = NULL;
    prt_usart_info = USART_GetInfo(UART4);

