OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USART/Driver_USART_UART.c
    if (prt_usart_info)
    {
        UARTn_IRQHandler(prt_usart_info);
    }

}

#endif

#if (RTE_USART5)
NVT_ITCM void UART5_IRQHandler(void)
{
    const USART_Info_t *prt_usart_info = NULL;
    prt_usart_info = USART_GetInfo(UART5);

    if (prt_usart_info)
    {
        UARTn_IRQHandler(prt_usart_info);
    }

}

#endif

#if (RTE_USART6)
NVT_ITCM void UART6_IRQHandler(void)
{
    const USART_Info_t *prt_usart_info = NULL;
    prt_usart_info = USART_GetInfo(UART6);

    if (prt_usart_info)
    {
        UARTn_IRQHandler(prt_usart_info);
    }

}

#endif

#if (RTE_USART7)
NVT_ITCM void UART7_IRQHandler(void)
{
    const USART_Info_t *prt_usart_info = NULL;
    prt_usart_info = USART_GetInfo(UART7);

    if (prt_usart_info)
    {
        UARTn_IRQHandler(prt_usart_info);
    }

}

#endif

#if (RTE_USART8)
NVT_ITCM void UART8_IRQHandler(void)
{
    const USART_Info_t *prt_usart_info = NULL;
    prt_usart_info = USART_GetInfo(UART8);

    if (prt_usart_info)
    {
        UARTn_IRQHandler(prt_usart_info);
    }

}

#endif

#if (RTE_USART9)
NVT_ITCM void UART9_IRQHandler(void)
{
    const USART_Info_t *prt_usart_info = NULL;
    prt_usart_info = USART_GetInfo(UART9);

    if (prt_usart_info)
    {
        UARTn_IRQHandler(prt_usart_info);
    }

}

#endif

// Local driver functions definitions (for instances)
#if (RTE_USART0)
    FUNCS_DEFINE(0)
#endif
#if (RTE_USART1)
    FUNCS_DEFINE(1)
#endif
#if (RTE_USART2)
    FUNCS_DEFINE(2)
#endif
#if (RTE_USART3)
    FUNCS_DEFINE(3)
#endif
#if (RTE_USART4)
    FUNCS_DEFINE(4)
#endif
#if (RTE_USART5)
    FUNCS_DEFINE(5)
#endif
#if (RTE_USART6)
    FUNCS_DEFINE(6)
#endif
#if (RTE_USART7)
    FUNCS_DEFINE(7)
#endif
#if (RTE_USART8)
    FUNCS_DEFINE(8)
#endif
#if (RTE_USART9)
    FUNCS_DEFINE(9)
#endif

// Global driver structures ****************************************************

#if (RTE_USART0)
    USART_DRIVER(0)
#endif
#if (RTE_USART1)
    USART_DRIVER(1)
#endif
#if (RTE_USART2)
    USART_DRIVER(2)
#endif
#if (RTE_USART3)
    USART_DRIVER(3)
#endif
#if (RTE_USART4)
    USART_DRIVER(4)
#endif
#if (RTE_USART5)
    USART_DRIVER(5)
#endif
#if (RTE_USART6)
    USART_DRIVER(6)
#endif
#if (RTE_USART7)
    USART_DRIVER(7)
#endif
#if (RTE_USART8)
    USART_DRIVER(8)
#endif
#if (RTE_USART9)
    USART_DRIVER(9)
#endif


#endif  // DRIVER_CONFIG_VALID
